tutorials/compressible/sonicFoam/laminar/forwardStep/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {}
    p
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
    }
    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
    }
    e
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors      2;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    U       1;
    UFinal  1;
    e       1;
    eFinal  1;
}

// ************************************************************************* //
